{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Python_Homework 4. Функции"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Вам нужно помочь секретарю автоматизировать работу. Для этого нужно написать программу, которая будет на основе хранимых данных исполнять пользовательские команды.\n",
    "\n",
    "#### Общие требования к программе:\n",
    "\n",
    "код должен быть грамотно декомпозирован (каждая функция отвечает за свою конкретную задачу, дублирующийся функционал переиспользуется, а его код не повторяется);\n",
    "в коде отсутствуют глобальные переменные (за исключением documents и directories);\n",
    "пользовательский ввод обрабатывается в цикле while до тех пор, пока пользователь явно не завершит программу (вводом команды “q”).\n",
    "\n",
    "\n",
    "### Задание 1\n",
    "\n",
    "* Пользователь по команде “p” может узнать владельца документа по его номеру (+)\n",
    "* Пользователь по команде “s” может по номеру документа узнать на какой полке он хранится (+)\n",
    "* Пользователь по команде “l” может увидеть полную информацию по всем документам (+)\n",
    "* Пользователь по команде “as” может добавить новую полку (+)\n",
    "* Пользователь по команде “ds” может удалить существующую полку из данных (только если она пустая) ()\n",
    "\n",
    "\n",
    "### Задание 2\n",
    "\n",
    "* Пользователь по команде \"ad\" может добавить новый документ в данные ()\n",
    "* Пользователь по команде \"d\" может удалить документ из данных ()\n",
    "* Пользователь по команде \"m\" может переместить документ с полки на полку ()\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Исходные данные имеют следующую структуру:\n",
    "\n",
    "# Перечень всех документов\n",
    "documents = [\n",
    " {'type': 'passport', 'number': '2207 876234', 'name': 'Василий Гупкин'},\n",
    " {'type': 'invoice', 'number': '11-2', 'name': 'Геннадий Покемонов'},\n",
    " {'type': 'insurance', 'number': '10006', 'name': 'Аристарх Павлов'}\n",
    "]\n",
    "\n",
    "# перечень полок, на которых хранятся документы (если документ есть в documents, \n",
    "# то он обязательно должен быть и в directories)\n",
    "directories = {\n",
    " '1': ['2207 876234', '11-2'],\n",
    " '2': ['10006'],\n",
    " '3': []\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def owner():\n",
    "    \"\"\"\n",
    "    Пользователь ввел команду P и может узнать владельца документа по его номеру\n",
    "    \"\"\" \n",
    "    doc_id = input('Введите номер документа: ')\n",
    "    for doc in documents:\n",
    "        if doc['number'] == doc_id:\n",
    "            print(f\"Результат: {doc['name']}\")\n",
    "            return\n",
    "    print('Запрашиваемый документ не найден в Базе Данных.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "def shelf():\n",
    "    \"\"\"\n",
    "    Пользователь ввел команду S и может по номеру документа узнать на какой полке он хранится\n",
    "    \"\"\"  \n",
    "    doc_id = input('Введите номер документа: ')\n",
    "    for key, value in directories.items():\n",
    "        if doc_id in value:\n",
    "            print(f'Результат: {key}')\n",
    "            return\n",
    "    print('Запрашиваемый документ не найден в Базе Данных.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "def full_info():\n",
    "    \"\"\"\n",
    "    Пользователь ввел команду I и может увидеть полную информацию по всем документам\n",
    "    \"\"\"   \n",
    "    for doc_num, doc in enumerate(documents):\n",
    "        print(f\"Документ №{doc_num + 1}: Тип документа: {doc['type']}, Номер документа: {doc['number']}, Имя владельца: {doc['name']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def new_shelf():\n",
    "    \"\"\"\n",
    "    Пользователь ввел команду AS и может добавить новую полку\n",
    "    \"\"\"   \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def arsenal(string):\n",
    "    \"\"\"\n",
    "    Данная функция содержит в себе набор всех возможных действий внутри нашей программы и роутит \n",
    "    входящие данные от оператора в блок, отвечающий за каждое действие\n",
    "    \"\"\"\n",
    "    if string == 'P':\n",
    "        owner()\n",
    "    elif string == 'S':\n",
    "        shelf()\n",
    "    elif string == 'I':\n",
    "        full_info()\n",
    "    elif string == 'AS':\n",
    "        new_shelf()\n",
    "    elif string == 'DS':\n",
    "        delete_shelf()\n",
    "    else:\n",
    "        print('Вы ввели неподдерживаемую команду. Попробуйте еще раз!')      "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите необходимую команду: i\n",
      "Документ №1: Тип документа: passport, Номер документа: 2207 876234, Имя владельца: Василий Гупкин\n",
      "Документ №2: Тип документа: invoice, Номер документа: 11-2, Имя владельца: Геннадий Покемонов\n",
      "Документ №3: Тип документа: insurance, Номер документа: 10006, Имя владельца: Аристарх Павлов\n",
      "Введите необходимую команду: i\n",
      "Документ №1: Тип документа: passport, Номер документа: 2207 876234, Имя владельца: Василий Гупкин\n",
      "Документ №2: Тип документа: invoice, Номер документа: 11-2, Имя владельца: Геннадий Покемонов\n",
      "Документ №3: Тип документа: insurance, Номер документа: 10006, Имя владельца: Аристарх Павлов\n",
      "Введите необходимую команду: q\n",
      "Спасибо, за использование нашей программы!\n"
     ]
    }
   ],
   "source": [
    "while True:\n",
    "    go = input(\"Введите необходимую команду: \").upper()\n",
    "    if go == 'Q':\n",
    "        print('Спасибо, за использование нашей программы!')\n",
    "        break\n",
    "    else:\n",
    "        arsenal(go)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
